backend/views/ms-institution/_form.php

	<?= $form->field($model, 'contact_email')->input('email')->label(false) ?>

    <label>ประเภทหน่วยงาน<span class="text-danger">*</span></label>
	<?= $form->field($model, 'type_id')->dropDownList(
    		ArrayHelper::map(MsInstitutionType::find()->all(), 'id', 'name_th'),
    		['prompt'=>'--- กรุณาเลือกประเภทหน่วยงาน ---']
    	)->label(false) ?>
---
SELECT * FROM `ms_institution_type`

    <div class="row">
    	<div class="col-md-6">
    		<label>จังหวัด<span class="text-danger">*</span></label>
     		<?= $form->field($model, 'province_id')->dropDownList(
    		ArrayHelper::map(MsProvince::find()->orderBy(['title'=>'desc'])->all(), 'id', 'title'),
    		['prompt'=>'--- เลือก จังหวัด ---',
              'onchange'=>'
    		     $("#img-load-MsAmphur").show();
                $.get( "'.Yii::$app->urlManager->createUrl('ms-institution/get-amphur').'"+ "&id=" +$(this).val(), function( data ) {
                  $( "select#amphur" ).html( data );
    		    $("#img-load-MsAmphur").hide();
                });
            ']
    	)->label(false);
---
SELECT * FROM `ms_province` ORDER BY `title`