backend/controllers/TrnEduTestingController.php

    public function actionSelectTest($id)
    {
        $model = TrnEduTesting::find()
        ->where("id = $id and status = 1 and deleted = 0")
        ->one();
    	$oLevel = TrnEduTestingEduLevel::find()->where("trn_edu_testing_id = $id and deleted = 0")->all();
    	$oSubjects = TrnEduTestingSubjects::find()->where("trn_edu_testing_id = $id and deleted = 0")->all();
    	$oLect = TrnEduTestingLecturer::find()->where("trn_edu_testing_id = $id and deleted = 0")->all();
    	$oTest = TrnEduTestingTestSet::find()->where("trn_edu_testing_id = $id and deleted = 0")->all();

    	$searchModel_t  = new TrnEduTestingTestSetSearch();
    	$searchModel_t->trn_edu_testing_id = $id;
    	$searchModel_t->deleted = 0;
    	$dataProviderT = $searchModel_t->searchFilterWhere(Yii::$app->request->queryParams);
    	$conditionArrCkSelect = "trn_edu_testing_id = $id and status = 1 and deleted = 0";
    	$oArrCkSelect = TrnEduTestingTestSet::find()
    	->where($conditionArrCkSelect)
    	->all();
---
SELECT * FROM `trn_edu_testing` WHERE id = 19 and status = 1 and deleted = 0
SELECT * FROM `trn_edu_testing_edu_level` WHERE trn_edu_testing_id = 19 and deleted = 0
SELECT * FROM `trn_edu_testing_subjects` WHERE trn_edu_testing_id = 19 and deleted = 0
SELECT * FROM `trn_edu_testing_lecturer` WHERE trn_edu_testing_id = 19 and deleted = 0
SELECT * FROM `trn_edu_testing_test_set` WHERE trn_edu_testing_id = 19 and deleted = 0
SELECT * FROM `trn_edu_testing_test_set` WHERE trn_edu_testing_id = 19 and status = 1 and deleted = 0

    public function actionView($id)
    {
        $oLevel = TrnEduTestingEduLevel::find()->where("trn_edu_testing_id = $id and deleted = 0")->all();
        $oSubjects = TrnEduTestingSubjects::find()->where("trn_edu_testing_id = $id and deleted = 0")->all();
        $oLect = TrnEduTestingLecturer::find()->where("trn_edu_testing_id = $id and deleted = 0")->all();
        $oTest = TrnEduTestingTestSet::find()->where("trn_edu_testing_id = $id and deleted = 0")->all();
---
SELECT * FROM `trn_edu_testing_edu_level` WHERE trn_edu_testing_id = 20 and deleted = 0
SELECT * FROM `trn_edu_testing_subjects` WHERE trn_edu_testing_id = 20 and deleted = 0
SELECT * FROM `trn_edu_testing_lecturer` WHERE trn_edu_testing_id = 20 and deleted = 0
SELECT * FROM `trn_edu_testing_test_set` WHERE trn_edu_testing_id = 20 and deleted = 0

    protected function findModel($id)
    {
        if (($model = TrnEduTesting::findOne($id)) !== null) {
---
SELECT * FROM `trn_edu_testing` WHERE `id`='20'