common/models/TrnEduTesting.php

SELECT * FROM `trn_edu_testing_edu_level` WHERE trn_edu_testing_id	 = 19
---
    public function getTotalExa() {
     	$model = TrnEduTestingEduLevel::find()
     	->where("trn_edu_testing_id	 = $this->id")
     	->All();