backend/views/report/_search.php

SELECT * FROM `ms_test_type`
---
			<label>ประเภทแบบทดสอบ</label>
		</div>
		<div class="col-lg-2">
		<?=$form->field ($model, 'ms_test_type_id' )->dropDownList(ArrayHelper::map ( MsTestType::find ()->all (), 'id', 'name_th' ), [ 'class'=>'form-control add_font',
									    'prompt' => '--โปรดเลือก--',
									    'data-name'=>'test_type_id',
									    'onchange' => '
									                $( "select#trnedutestingsearch-ms_subjects_id" ).select2("val", "");
													$.post("index.php?r=ms-subjects/subjects-lists&all=0&id=' . '"+$(this).val(), function( data ) {
													$( "select#trnedutestingsearch-ms_subjects_id" ).html( data );
													});' ] )->label (false);?>

SELECT * FROM `ms_subjects`
---
		</div>
		<div class="col-lg-2">

												<?=$form->field ($model, 'ms_subjects_id' )->widget ( Select2::className (), [
												    'data' => ArrayHelper::map (
												    MsSubjects::find ()
												    ->all (),
												    'id', 'name_th' ),'language' => 'en','options' => [
												        'placeholder' => 'เลือกวิชา',
												        'data-name'=>'ms_subjects_id',
												        'onchange' => '
									                $( "select#trnedutestingsearch-ms_test_set_id" ).select2("val", "");
													$.post("index.php?r=ms-test-set/select-lists&all=0&id=' . '"+$(this).val(), function( data ) {
													$( "select#trnedutestingsearch-ms_test_set_id" ).html( data );
													});'
												    ],'pluginOptions' => ['allowClear' => true ] ] )->label (false);?>

SELECT * FROM `ms_test_set` ORDER BY `code_name`
---
			<label>ชื่อแบบทดสอบ</label>
		</div>
		<div class="col-lg-3">
			<?=$form->field ( $model, 'id')->widget ( Select2::className (), [ 'data' => ArrayHelper::map ( MsTestSet::find ()->orderBy('code_name asc')->all (), 'id', 'code_name' ),'language' => 'en','options' => [ 'placeholder' => ' ชื่อแบบทดสอบ ...' ,
			    'data-name'=>'trn_edu_testing_test_set_id'],
			    'pluginOptions' => [ 'allowClear' => true ]

			] )->label (false);?>