backend/views/trn-edu-testing/_form.php

								<?php if(isset($_SESSION['ins_id'])) $model->ins_id = $_SESSION['ins_id'];?>
								<input type="hidden" name="inst_select" id="inst_select" value"0">
    								<?php Pjax::begin(['id'=>'institution_pjax_id']); ?>
    								<?=$form->field ( $model, 'ins_id')->widget ( Select2::className (), [ 'data' => ArrayHelper::map ( MsInstitution::find ()->orderBy('name_th asc')->all (), 'id', 'name_th' ),'language' => 'en','options' => [ 'placeholder' => ' เลือก หน่วยงาน ...','data-name'=>'ins_id' ],'pluginOptions' => [ 'allowClear' => true ] ] )->label ( false );?>
---
SELECT * FROM `ms_institution` ORDER BY `name_th`

								</div>
								<div class="col-lg-8">
								<?php if(isset($_SESSION['obj_id'])) $model->obj_id = $_SESSION['obj_id'];?>
									<?=$form->field ( $model, 'obj_id' )->dropDownList ( ArrayHelper::map ( MsObjective::find ()->all (), 'id', 'name_th' ), [ 'class'=>'form-control add_font', 'prompt' => '--- เลือกวัตถุประสงค์ในการสอบ ---', 'data-name'=>'obj_id' ] )->label ( false );?>
---
SELECT * FROM `ms_objective`

									<?php Pjax::begin(['timeout' => 5000 ,'id'=>'subjects_pjax_id']); ?>
								<div class="col-lg-5">
								<?php if(isset($_SESSION['test_type_id'])) $model->test_type_id = $_SESSION['test_type_id'];?>
									<?=$form->field ($model, 'test_type_id' )->dropDownList(ArrayHelper::map ( MsTestType::find ()->all (), 'id', 'name_th' ), [ 'class'=>'form-control add_font',
									    'prompt' => '--โปรดเลือก--',
									    'data-name'=>'test_type_id',
									    'onchange' => '
									                $( "select#trnedutesting-ms_subjects_id" ).select2("val", "");
													$.post("index.php?r=ms-subjects/subjects-lists&all=1&id=' . '"+$(this).val(), function( data ) {
													$( "select#trnedutesting-ms_subjects_id" ).html( data );
													});' ] )->label ("ประเภทแบบทดสอบ");?>
---
SELECT * FROM `ms_test_type`

									<?php Pjax::begin(['timeout' => 5000,'id'=>'lecturer_pjax_id']); ?>
									<?php if(isset($_SESSION['trn_edu_testing_lecturer_id'])) $model->trn_edu_testing_lecturer_id = $_SESSION['trn_edu_testing_lecturer_id'];?>

									<?=$form->field ( $model, 'trn_edu_testing_lecturer_id')->widget ( Select2::className (), [ 'data' => ArrayHelper::map ( MsLecturer::find ()->orderBy('name_th asc')->all (), 'id', 'fullname' ),'language' => 'en','options' => [ 'placeholder' => ' เลือก หน่วยงาน ...' , 'data-name'=>'trn_edu_testing_lecturer_id'],'pluginOptions' => [ 'allowClear' => true ] ] )->label ("ชื่อวิทยากร");?>
---
SELECT * FROM `ms_lecturer` ORDER BY `name_th`