backend/views/trn-edu-testing/_search.php

SELECT * FROM `ms_institution` ORDER BY `name_th`
---
			<label>ชื่อหน่วยงาน</label>
		</div>
		<div class="col-lg-3">
			<?=$form->field($model, 'ins_id')->widget ( Select2::className (), [ 'data' => ArrayHelper::map ( MsInstitution::find ()->orderBy('name_th asc')->all (), 'id', 'name_th' ),'language' => 'en','options' => [ 'placeholder' => ' เลือก หน่วยงาน ...','data-name'=>'ins_id' ],'pluginOptions' => [ 'allowClear' => true ] ] )->label ( false );?>

SELECT * FROM `ms_objective`
---
			<label>วัตถุประสงค์ในการสอบ</label>
		</div>
		<div class="col-lg-3">
			<?=$form->field($model, 'obj_id' )->dropDownList ( ArrayHelper::map ( MsObjective::find ()->all (), 'id', 'name_th' ), [ 'prompt' => '--- เลือกวัตถุประสงค์ในการสอบ ---' ] )->label ( false );?>

SELECT * FROM `ms_test_type`
---
			<label>ประเภทแบบทดสอบ</label>
		</div>
		<div class="col-lg-2">
		<?=$form->field ($model, 'ms_test_type_id' )->dropDownList(ArrayHelper::map ( MsTestType::find ()->all (), 'id', 'name_th' ), [ 'class'=>'form-control add_font',
									    'prompt' => '--โปรดเลือก--',
									    'data-name'=>'test_type_id',
									    'onchange' => '
									                $( "select#trnedutestingsearch-ms_subjects_id" ).select2("val", "");
													$.post("index.php?r=ms-subjects/subjects-lists&all=0&id=' . '"+$(this).val(), function( data ) {
													$( "select#trnedutestingsearch-ms_subjects_id" ).html( data );
													});' ] )->label (false);?>

SELECT * FROM `ms_subjects`
---
		</div>
		<div class="col-lg-2">

												<?=$form->field ($model, 'ms_subjects_id' )->widget ( Select2::className (), [
												    'data' => ArrayHelper::map (
												    MsSubjects::find ()
												    ->all (),
												    'id', 'name_th' ),'language' => 'en','options' => [
												        'placeholder' => 'เลือกวิชา',
												        'data-name'=>'ms_subjects_id',
												        'onchange' => '
									                $( "select#trnedutestingsearch-ms_test_set_id" ).select2("val", "");
													$.post("index.php?r=ms-test-set/select-lists&all=0&id=' . '"+$(this).val(), function( data ) {
													$( "select#trnedutestingsearch-ms_test_set_id" ).html( data );
													});'
												    ],'pluginOptions' => ['allowClear' => true ] ] )->label (false);?>

SELECT * FROM `ms_test_set` ORDER BY `code_name`
---
			<label>ชื่อแบบทดสอบ</label>
		</div>
		<div class="col-lg-2">
			<?=$form->field ( $model, 'ms_test_set_id')->widget ( Select2::className (), [ 'data' => ArrayHelper::map ( MsTestSet::find ()->orderBy('code_name asc')->all (), 'id', 'code_name' ),'language' => 'en','options' => [ 'placeholder' => ' ชื่อแบบทดสอบ ...' ,
			    'data-name'=>'trn_edu_testing_test_set_id'],
			    'pluginOptions' => [ 'allowClear' => true ]

			] )->label (false);?>

SELECT * FROM `ms_edu_level_phase`
---
			<label>ช่วงชั้น/ปีที่</label>
		</div>
		<div class="col-lg-2">
		<?=$form->field ( $model, 'ms_edu_level_phase_id' )->dropDownList ( ArrayHelper::map (
									    MsEduLevelPhase::find ()
									    ->all(), 'id', 'name_th' ), [ 'class'=>'form-control add_font', 'prompt' => '--- เลือกช่วงชั้น ---', 'data-name'=> 'trn_edu_testing_edu_level_phase_id'
		] )->label (false);?>

SELECT * FROM `ms_lecturer` ORDER BY `name_th`
---
			<label>ชื่อวิทยากร</label>
		</div>
		<div class="col-lg-2">
			<?=$form->field ( $model, 'ms_lecturer_id')->widget ( Select2::className (), [ 'data' => ArrayHelper::map ( MsLecturer::find ()->orderBy('name_th asc')->all (), 'id', 'fullname' ),'language' => 'en','options' => [ 'placeholder' => 'ชื่อวิทยากร ...' , 'data-name'=>'trn_edu_testing_lecturer_id'],'pluginOptions' => [ 'allowClear' => true ] ] )->label (false);?>