backend/views/trn-edu-testing/select-test.php

                					<?php
                					$total = 0;
                					foreach ($oLevel as $level){?>
                					<tr><td>ระดับ<?=$level->eduLevel->name_th." ".$level->eduLevelPhase->name_th?></td><td><?=$level->count_examiner?></td></tr>
---
SELECT * FROM `ms_edu_level_phase` WHERE `id`=2
SELECT * FROM `ms_edu_level` WHERE `id`=1

								<label>ประเภทแบบทดสอบ</label>
							</div>
							<div class="col-xs-3">
								<?=$form->field ( $mTestSetSearch, 'test_type_id' )
									->dropDownList ( ArrayHelper::map ( MsTestType::find ()->all (), 'id', 'name_th' ),
									[ 'prompt' => '--- ประเภทแบบทดสอบทั้งหมด ---' ] )->label ( false );?>
---
SELECT * FROM `ms_test_type`

								<label>ชื่อวิชา</label>
							</div>
							<div class="col-xs-3">
								<?=$form->field ( $mTestSetSearch, 'subject_id' )
									->dropDownList ( ArrayHelper::map ( MsSubjects::find ()->all (), 'id', 'name_th' ),
									[ 'prompt' => '--- เลือกชื่อวิชาทั้งหมด ---' ] )->label ( false );?>
---
SELECT * FROM `ms_subjects`

								<label>ระดับ</label>
							</div>
							<div class="col-xs-2">
								<?=$form->field ( $mTestSetSearch, 'edu_level_id' )
									->dropDownList ( ArrayHelper::map ( MsEduLevel::find ()->all (), 'id', 'name_th' ),
									[ 'prompt' => '--- เลือกระดับทั้งหมด ---' ] )->label ( false );?>
---
SELECT * FROM `ms_edu_level`

								<label>ระดับ</label>
							</div>
							<div class="col-xs-3">
								<?=$form->field ( $mTestSetSearch, 'edu_level_id' )
									->dropDownList ( ArrayHelper::map ( MsEduLevel::find ()->all (), 'id', 'name_th' ),
									[ 'prompt' => '--- เลือกระดับทั้งหมด ---' ] )->label ( false );?>
---
SELECT * FROM `ms_edu_level`

				        		'format' => 'raw',
				        		'value' => function ($model, $index, $widget) {
				        		$condition = "test_set_id = $model->id and status = 2 and deleted = 0";
				        		$iTestSet = count(TrnEduTestingTestSet::find()->where($condition)->all());
---
SELECT * FROM `trn_edu_testing_test_set` WHERE test_set_id = 2 and status = 2 and deleted = 0