backend/views/trn-edu-testing/view.php

SELECT * FROM `ms_edu_level_phase` WHERE `id`=3
SELECT * FROM `ms_edu_level` WHERE `id`=2
---
                					<?php
                					$total = 0;
                					foreach ($oLevel as $level){?>
                					<tr><td>ระดับ<?=$level->eduLevel->name_th." ".$level->eduLevelPhase->name_th?></td><td><?=$level->count_examiner?></td></tr>